#+TITLE: EMACS NOTES
#+AUTHOR: Eduardo Vedes
#+DATE: 2022-05-04
#+OPTIONS: toc:2 num:nil
#+STARTUP: content

Where I take notes about my Emacs learning.
This file can be seen [[https://github.com/evedes/.dotfiles/blob/master/emacs/notes/emacs-notes.org][here]], on my GitHub .dotfiles repo.

*** How to run a src block?

Type *M-x org-babel-execute-src-block* or *C-c C-c* on top of the block you want to execute.

#+begin_src emacs-lisp :results value

  (message "Hello, World!")

#+end_src

#+RESULTS:
: Hello, World!

#+begin_src emacs-lisp

  (org-babel-do-load-languages
   'org-babel-load-languages
   '((emacs-lisp . t)
     (python . t)))

  (setq org-confirm-babel-evaluate nil)

#+end_src

#+RESULTS:

